app/Controllers/Home.php

SELECT *
FROM `receive_message`
ORDER BY `date` DESC, `time` DESC
---
    private function getLastThreeMessages()
    {
        $model = new ReceiveMessageModel();
        return $model->orderBy('date', 'desc')
                     ->orderBy('time', 'desc')
                     ->limit(3)
                     ->findAll();

SELECT *
FROM `solar_voltage`
---
    public function userDashboard(){
        $waterLevelModel = new WaterLevelModel();
        $rainfallModel = new RainfallModel();
        $solarVoltageModel = new SolarVoltageModel();
        $userModel = new UserModel();

        $waterLevels = $waterLevelModel->findAll();
        $monthlyWaterLevels = [];

        foreach ($waterLevels as $level) {
            $month = date('F', strtotime($level['date']));
            $waterLevel = $level['waterlevel'];

            if (!isset($monthlyWaterLevels[$month])) {
                $monthlyWaterLevels[$month] = ['total' => 0, 'low' => 0, 'moderate' => 0, 'high' => 0];
            }

            $monthlyWaterLevels[$month]['total']++;

            if ($waterLevel > 2.00 && $waterLevel <= 3.00) {
                $monthlyWaterLevels[$month]['high']++;
            } elseif ($waterLevel > 1.00 && $waterLevel <= 2.00) {
                $monthlyWaterLevels[$month]['moderate']++;
            } elseif ($waterLevel > 0 && $waterLevel <= 1.00) {
                $monthlyWaterLevels[$month]['low']++;
            }
        }

         // Solar voltage processing
         $solarVoltages = $solarVoltageModel->findAll();

SELECT *
FROM `rainfall`
---
             $dailyVoltages[$date] += $voltage['voltage'];
         }

        $rainfalls = $rainfallModel->findAll();

SELECT *
FROM `user`
WHERE `user`.`id` = '16'
---

        // Fetch user data
        $currentUserId = session()->get('user_id');
        $user = $userModel->find($currentUserId);